<template>
  <el-row :gutter="20" type="flex" justify="space-between">
    <el-col :span="20" class="box">
      <el-card shadow="hover">
        <el-collapse v-model="activeNames" @change="handleChange">
          <el-collapse-item title="教育，向美而生" name="1">
            <div class="text item">
              郑英老师说：“教育，是一项向美而生的事业。”“教师，首先要让自己成为一个美好的人。”郑英老师其人，即是“美好”的代名词。在这次讲座中，她饱腹诗书的气质、举手投足的优雅、笑容可掬的态度……都鲜活地向我们诠释着“美好”。
              <p>
                看了《教育，向美而生》这本书之后，第一感受就是，郑英老师一定是个内心柔软的女人，她把工作和生活过成了诗和远方。她每周都会定一束鲜花精心侍弄；每次出门着装都保持清新整洁；每次看书都要将手洗净……这些事情在一般人眼里或许要多花费很多时间，但也正因为需要花时间，才更能体现出对生活的深情。
              </p>
              <p>
                其实我在学校里接触过很多老师，觉得他们身上都有这种对生活的深情。比如胡铁城校长，前不久在我裹着羽绒服去上早读的路上，看见他穿着运动短袖在跑步；还有胡自强部长、邱勇兵和汤军老师，他们经常结伴打乒乓球、去郊外骑行；还有汪正文老师，每个月都坚持跑步；还有当时被戏称是“祁门陶渊明”的汪文峰老师，办公室里的花花草草养的生机勃勃；还有现在办公室的“多肉达人”杨军师老师……从他们身上，我看到了生活的美好，这种对生活的美的追求，无关年纪、无关学识、无关金钱，只关乎对人、对己、对物的深爱……
              </p>
              <p>
                真正的教育，不离生活之美，因为我们自己就是一门课程，我们对待生活的态度会影响孩子们对待生活的态度。过好自己的生活，会为教育注入新鲜美好的元素，从某种意义上说，会以拐弯的方式为教育人生做新的笺注和眉批。
              </p>
              <p>所以说，成为一个美好的人，首先应该是一个热爱生活的人。</p>
              <p>再者，成为一个美好的人，还应当是一个诗人。</p>
              <p>
                马卡连柯说：“教育是像诗一样美好的科学，尤其是教育新人的过程中更如同诗歌创作一样，其间充满着艰难困苦的探索，同时也极富浪漫传奇的色彩。”师者，当怀一颗诗心，而作为一名语文教师，更应如此。我们不是文章、修辞、语言、考试的分析家，也不是教材和教参的操纵者。一个语文老师，应该有远比“语文”更宽阔的视野，即引导学生发现美。师者，当以一颗诗心领悟美，再引导学生感同身受。
              </p>
              <p>
                昨天上公开课《夜归鹿门歌》的时候，我就发现拥有一颗诗心真的很重要，我们讲缘景明情，如果没有一颗诗心，又怎么去领会那些意象，置身那样的诗境，与诗人达到共情呢？
              </p>
              <p>
                所以，我期望自己能成为一个美好的人，热爱生活，富有诗意，追慕美好，向美而行。
              </p>
            </div>
          </el-collapse-item>
        </el-collapse>
      </el-card>
      <el-card shadow="hover">
        <el-collapse v-model="activeNames" @change="handleChange">
          <el-collapse-item title="复恐匆匆说不尽，行人临发又开封" name="2">
            <div class="text item">
              复恐匆匆说不尽，行人临发又开封”出自张籍《秋思》，两句活画出了人物匆忙间托人捎信的微妙的内心活动。意思是：出门远行的游子托人给家人捎信，问候、思念、担忧、父母妻儿。这首诗表达了做客异多的游子深切怀念故乡和亲人的思想感情。
              <p>
                要说的话很多很多。书成之后，似乎想说的话都已经写上了；但当捎信的人即将出发的时候，又担心起来，感到刚才太匆忙，无暇细细思考，生怕漏掉了什么重要的内容，于是又把已经封好的信拆开来再看一遍。
              </p>
              <p>
                诗人对亲人的深切思念，千言万语，难以尽述。“临发又开封”一句，将这种心理刻画得入木三分，情真意切，别致生动，充分表达出他乡游子丰富复杂的思想情意。
              </p>
              <p>
                北宋王安石在《题张司业诗》中评其诗说:“看似寻常最奇崛，成如容易却艰辛。”深谙张籍诗歌创作的要旨和甘苦。
              </p>
            </div>
          </el-collapse-item>
        </el-collapse>
      </el-card>
      <el-card shadow="hover">
        <el-collapse v-model="activeNames" @change="handleChange">
          <el-collapse-item title="人面不知何处去，桃花依旧笑春风" name="3">
            <div class="text item">
              “人面不知何处去，桃花依旧笑春风”两句出自崔护《题都城南庄》，意思是：去年的今天，我在这里遇到一位美丽的姑娘，一见钟情，爱意无限，可是如今来找她，春光依然明媚，桃花依然红艳，那风姿绰约、楚楚可人的姑娘却不知哪里去了?只有和她一样美丽的桃花依然在春风中露出迷人的笑靥。这首诗描写诗人故地重游、追觅心有所属的美丽姑娘。不巧的是未能相遇，睹物思人，表达出一种委婉情深的爱意和悠悠长恨的眷恋之情。
              <p>
                语言通俗浅近，叙写简洁，情味深永。特别是“不知”“依旧”词语的运用，委婉含蓄地表达了诗人内心深沉、复杂的情感，使诗句节奏有一定跌宕，并涂抹上一层浓郁的感情色彩，耐人寻味。
              </p>
              <p>
                据唐代孟棨《本事诗》记载:崔护于德宗贞元元年(公元785年)赴长安应进土试，落第后去郊野踏青解闷。在城南一桃花盛开的院门前求水喝，见到一个美丽的姑娘，巧笑怡人，美目流盼，倚着灼灼桃花，楚楚动人。崔护情摇意夺，以言语试其心愿。姑娘欲言不言，如不胜情。第二年清明，崔护又来到南庄，寻找姑娘。只见门前桃花依旧，无语迎人，门上却挂了把将军锁，寂静无人。崔护怅然有失，便在门上题写了这首诗，并署上自己的姓名。
              </p>
              <p>
                姑娘回家，读了门上题诗，进门便卧床不起。过了几天，崔护眷念姑娘，又去寻访。进门见姑娘躺在床上，面如纸色，已经奄奄一息了。便大声哭喊道:“大姐醒醒，大姐醒醒，崔护看你来了!”
              </p>
              <p>
                原来姑娘姓桃名小春，自幼勤读诗书，尚未许人。自去年见到崔护以后，便整日闷闷不乐，失魂落魄。前几日为亡母扫墓归来，见了门上题诗，一病不起，已不省人事多日了。
              </p>
              <p>
                听到崔护的哭喊声，姑娘渐渐缓过气来，见是崔护，嘤嘤啜泣。经过此番波折，两人更觉难舍难分，遂结百年之好。贞元十二年(公元796年)，崔护考中进士，夫妻和睦，生活美满。
              </p>
              <p>
                后人还以此为题材，编写了《崔护求浆》《人面桃花》等戏剧，在民间广为流传。
              </p>
              <p>
                今天，“人面桃花”常用来比喻思慕不可见的姑娘而产生的惆怅心情。
              </p>
            </div>
          </el-collapse-item>
        </el-collapse>
      </el-card>
      <el-card shadow="hover">
        <el-collapse v-model="activeNames" @change="handleChange">
          <el-collapse-item title="电影长津湖之水门桥" name="4">
            <div class="text item">
              “抗美援朝，保家卫国！”当这八个大字响彻在长津湖上空时，美军的失败已经在所难免了。面对我们这支具有钢铁意志的强大队伍，无论你是多么厉害，但只要侵占我国领土，虽远必诛。
              <p>
                《长津湖之水门桥》主要讲了——第七穿插连随军队进攻长津湖后，又接到命令，立即赶往水门桥，切断领军退路，炸毁水门桥。尽管前方危机重重，但七连仍不惧危难，继续前进。虽然最后没有成功炸桥，但七连这种前赴后继的精神击溃了美军的内心防线，让他们慌忙撤走。
              </p>
              <p>
                第七穿插连应到157人，实到一人！”许多人因伍万里的报数而破防了，第七穿插连以自己的大伤亡换来了国家和大队伍的小伤亡。一百多号人在冰天雪地之下，枪林弹雨之中，仍坚守在自己的岗位，完成了自己尚未完成的任务，他们向世人介绍了什么叫钢铁的意志钢铁汉——与别人装备天差地别，仍一个接一个，前赴后继的往上冲；尽管自己性命难保，仍抱着炸药往前进；知道自己可能会死，但仍以一己之力拯救一队的人……什么叫钢铁的意志钢铁汉？七连向我们完美诠释，整个志愿军都向我们完美诠释了什么叫钢铁的意志钢铁汉！七连整整157人，有156人都倒在了战场上，都为了完成任务而奉献出了自己那宝贵的生命，他们用鲜血染红了雪地，以不屈的生命铸就中国的崛起。
              </p>
              <p>
                有人说《长津湖之水门桥》没有彩蛋，但我认为，出门看见万家灯火，这就是最大的彩蛋。
              </p>
              <p>
                七连就是个人，就站在这，他比那房子还高，比那树还高，伤痕累累，他从来都不倒，所以他是钢，钢铁的意志钢铁汉。
              </p>
            </div>
          </el-collapse-item>
        </el-collapse>
      </el-card>
      <el-card shadow="hover">
        <el-collapse v-model="activeNames" @change="handleChange">
          <el-collapse-item title="夏洛的网" name="5">
            <div class="text item">
              这本书主要讲了可爱的小猪威尔伯和蜘蛛夏洛的故事，故事发生在弗恩这个小女孩身上，她遇到一个落脚猪也就是威尔伯，她每天都喂它，但是有一天她的小猪大到不能再养了，只好把威尔伯放在朱克曼先生家里的农场。有一次威尔伯无意中交了一个朋友，这个朋友灰色的身子会织网，它就是蜘蛛夏洛。可是猪生来就是要杀掉吃的，威尔伯也逃不掉，在这紧要的关头，夏洛想出了一个主意，在它的网上织出“王牌猪、了不起、光彩照人”，这让朱克曼先生觉得威尔伯是一头非比寻常的猪，这样一来，就保留了威尔伯的性命，它还得了一枚奖章。但夏洛就没有那么好了，它因为过度劳累而死去……
              <p>
                夏洛和小猪的友谊太深了，夏洛曾经说：“一只蜘蛛一生忙着捕捉和吃苍蝇是毫无意义的，通过帮助你也许可以得到生命的价值”。就连临死都一直为威尔伯着想，这一切不就是纯正、真正的友谊吗？
              </p>
              <p>
                读了这本书，我体会到什么是真诚的友谊，夏洛虽然是一只小小的蜘蛛，但它做到了人类都做不到的事情——它有真诚的友谊、诚实，为了朋友而失去生命。
              </p>
            </div>
          </el-collapse-item>
        </el-collapse>
      </el-card>
    </el-col>

    <el-card class="box-card" shadow="hover">
      <div slot="header" class="clearfix">
        <span>每日一句</span>
      </div>
      <div class="text item">
        谁说现在是冬天呢，你在时百花齐放，鸟唱蝉鸣。
        <p>以前我看到 “所爱隔山海，山海不可平”；</p>
        <p>当时我觉得 “海有舟可渡，山有路可行”；</p>
        <p>后来才发现 “山海皆可平，难平是人心” 。</p>
        <p>
          当代成年人的解压方式：发动态，删动态，换头像，换背景，沉默，听歌。
        </p>
      </div>
    </el-card>
    
  </el-row>
</template>

<script>
export default {
  name: "Jotter",
  data() {
    return {
      activeNames: [""],
    };
  },
  methods: {
    handleChange(val) {
      console.log(val);
    },
  },
};
</script>

<style scoped>
.box {
  height: 80%;
  display: flex;
  margin-left: 100px;
  flex-direction: column;
}
.el-card {
  /* min-width: 100px; */
  margin-top: 30px;
  padding: 10px;
}
.el-collapse {
  font-weight: bold;
}
.text {
  text-indent: 2em;
  text-align: left;
}
.box-card {
  margin-left: 30px;
  margin-right: 100px;
  height: 80%;
  width: 400px;
}
</style>
